[
  {
    "title": "test",
    "content": [
      "农场及采摘园:搜索请求应添加地理范围限定（如周边距离）和迭代机制（如多次搜索关键词扩展），以扩大候选POI数量并过滤不相关结果。",
      "所有类别（尤其需要时效性的场所）:在搜索请求中加入平台限定和时间范围限定，以提升结果的时效性和可靠性，从而增加POI数量。",
      "公园和风景区:搜索请求应包含具体设施描述（如滑梯、沙坑）和平台限定（如大众点评），以提升POI相关性和数量。",
      "农场和采摘园:搜索请求应包含迭代机制（如多次搜索）和动态调整（如扩展关键词），当POI不足时自动补充，以提高候选数量。"
    ]
  },
  {
    "title": "今年过年濮阳比较好玩的地方_20260129_190527",
    "content": [
      "如果搜索娱乐活动类（如灯会、庙会等）:在搜索请求中，采用更泛化的活动推荐关键词（如'城市+春节活动推荐'）替代特定活动名称关键词，并分步执行先搜活动列表再获取评价，以覆盖更多候选POI并确保相关性。",
      "如果搜索文化场馆类（如博物馆、科技馆等）:对搜索请求实施分层结构化策略（例如分博物馆、科技馆等子类执行），设置主关键词和备选关键词切换机制（如无结果则换用类似术语），并添加异常处理（如POI不足时自动补充搜索），以增强搜索的韧性和相关性。",
      "如果搜索周边休闲类（如温泉、农场等）:在搜索请求中嵌入节日特定体验关键词（如'春节活动'、'过年体验'），而非通用休闲术语，配合动态迭代（如首次结果少时精炼关键词为节日主题），以提升候选POI相关性和数量。",
      "如果搜索节日活动类（如灯会、庙会、游园会）:在搜索请求中优先使用扩展关键词列表和通用词（如‘活动推荐’），结合分步搜索策略，先通过平台内置功能获取活动列表再基于POI单独获取评价，以提高候选POI数量和信息完整性。",
      "如果搜索室内文化类（如博物馆、科技馆、美术馆）:在搜索请求中必须包含动态迭代机制和备用关键词（如平台切换和低POI数量触发补充搜索），并强制包含多角度用户评价搜索（如好评和差评术语），以确保低产出类别也能覆盖更多相关候选。",
      "如果搜索周边休闲类（如温泉、生态园、农家乐）:在搜索请求中限制关键词范围于特定时间段术语（如‘春节活动’代替宽泛词），设定初始活动主题键词并在低结果时自动切换到补充主题（如‘年味亲子农场’），以避免不相关POI。",
      "如果搜索主题活动类（如灯会、庙会、新春活动）:在搜索请求中使用扩展关键词集合（包括通用节日术语和具体活动词）以提高候选POI的数量和相关性。",
      "如果搜索室内文化场馆（如博物馆、科技馆、美术馆）:引入异常处理机制，在主搜索无结果或POI数量不足时，自动触发备选关键词和补充搜索，以强化相关性保障。",
      "如果搜索节日活动类（如灯会、庙会）:在搜索请求中使用扩展关键词列表和分步查询策略，包括通用推荐词（如'推荐'）和活动类别词（如'游园会'），以增加候选POI数量和相关性。",
      "如果搜索室内文化场馆类（如博物馆、科技馆）:结构化搜索请求为多层查询机制，包括主关键词、备选关键词（如'科普基地'失败时替换为'科学中心'），并设置结果阈值自动触发补充搜索（如'春节 室内景点'）以扩大候选POI池，确保覆盖。",
      "如果搜索休闲体验场所类（如温泉、农场）:在搜索请求中嵌入事件特定描述（如'春节活动'、'过年特色'），并优化迭代关键词，避免通用模糊词（如'冬季开放'）以优先聚焦相关POI。",
      "如果搜索节日活动现场(如灯会、庙会、游园会):使用包容性关键词列表和分步搜索策略，可显著增加候选POI数量。第一步搜索活动推荐总览避免遗漏小众活动；第二步聚焦单个POI评论，确保深度信息。",
      "如果搜索室内文化场馆(如博物馆、科技馆、美术馆):整合多类别搜索渠道与自动切换备选关键词机制，能提升搜索覆盖率。预设备用关键词(如失败时尝试替代术语)并强化异常处理(如POI数少时自动补充搜索)，避免迭代中断并确保结果全面。",
      "如果搜索周边休闲体验点(如温泉、生态园、农家乐):关键词需紧扣用户请求的具体场景(如'过年'),而非宽泛术语,以提升相关性。初始搜索包含'节日特色类关键词',并设置迭代机制仅在结果不足时扩展相似主题词,避免无关POI。",
      "如果搜索文化活动或节庆活动主题POI（如灯会、庙会、游园会）:搜索请求应采用分步策略：首先在社交媒体平台（如小红书、大众点评）使用综合活动推荐关键词（如‘春节活动推荐’）获取候选POI列表；继而针对每个POI单独搜索用户评价，利用平台功能如话题标签或评论区分，以确保POI数量和评论多样性。",
      "如果搜索室内文化场馆类POI（如博物馆、科技馆、美术馆）:行动规划必须包含关键词替补机制和异常处理：当主关键词搜索失败（如‘科技馆’无结果时），自动替换备选关键词（如‘科普基地’）；同时设置POI数量监控（若≤1），触发并行补充搜索以扩展候选范围，保证每个POI的相关性。",
      "如果搜索近郊休闲度假类POI（如温泉、农场、生态园）:搜索请求需精确嵌入节日主题关键词（如‘春节活动’或‘过年体验’），并采用迭代逻辑：若初始相关POI不足，立即切换更聚焦备选项（如‘年味亲子农场’），避免宽泛术语（如‘冬季农家乐’）以优先高相关候选。",
      "如果搜索节日活动类（如灯会、庙会）:在搜索请求中使用开放性的关键词组合（如‘推荐’、‘活动’）替代单一时间限定词（如‘2025年灯会’），以扩大覆盖范围并提升候选POI数量。",
      "如果搜索评价驱动的POI（如商场、展馆）:分步设计搜索请求：先识别POI列表，再针对每个POI单独搜索用户评价（使用标签或名称查询），确保全面获取多维度信息并强化相关性判断。",
      "如果搜索季节/节庆敏感性场所（如温泉、生态园）:搜索请求应动态切换关键词（初始用‘节日特色+类别’，失败后转‘备选主题+类别’），并嵌入异常监控（如POI≤1时触发补充搜索），避免迭代中断。",
      "如果搜索节庆活动类:设计搜索规划时应采用分步搜索策略，首先使用泛化关键词搜索活动概览列表，再针对每个候选POI单独收集用户评价，确保覆盖更多相关POI并提升信息完整性。",
      "如果搜索室内文化场馆类:在搜索请求中加入备选关键词迭代机制和异常处理步骤，如初始搜索结果不足时自动切换关键词并进行补充搜索，以扩大候选池并确保相关性。",
      "如果搜索节庆活动类（灯会/庙会/游园会）:采用先定位活动列表再细化POI详情的分步策略，结合扩展型关键词提升覆盖率",
      "如果搜索文化场馆类（博物馆/科技馆）:按子类分层搜索+备选关键词切换机制，结合异常处理补充策略确保类别完整性",
      "如果搜索周边休闲景点类（温泉/农场）:绑定节庆特性关键词（如'春节活动'/'过年体验'），避免使用宽泛季节词提升相关性"
    ]
  }
]